nickname = "deadnfixed"
# -1001564474914 - тестовий канал, -1001191692234 - ше один тестовий канал, -1001180084919 - петя
listen_to = "000"  # по ідеї можна вказати тег, наприклад "mcpetya_slivy"
forward_to = "111"
random_bot = "Random_UAbot"
soledar = "-1001211933154"
clan = "-1001702852086"
mc_petya_chat = "-1001614189896"
mc_petya_channel = "-1001180084919"

z_holodnogo_yaru = r"""У всякого своє лихо,
        І в мене не тихо,
        Хоч не своє, позичене,
        А все-таки лихо.
        Нащо б, бачся, те згадувать,
        Що давно минуло,
        Будить бознає колишнє —
        Добре, що заснуло.
        Хоч і Яр той, вже до його
        І стежки малої
        Не осталось; і здається,
        Що ніхто й ногою
        Не ступив там, а згадаєш,
        То була й дорога
        З манастиря Мотриного
        До Яру страшного.
        В Яру колись гайдамаки
        Табором стояли,
        Лагодили самопали,
        Ратища стругали.
        У Яр тойді сходилися,
        Мов із хреста зняті,
        Батько з сином і брат з братом
        Одностайне стати
        На ворога лукавого,
        На лютого ляха.
        Де ж ти дівся, в Яр глибокий
        Протоптаний шляху?
        Чи сам заріс темним лісом,
        Чи то засадили
        Нові кати? Щоб до тебе
        Люди не ходили
        На пораду, що їм діять
        З добрими панами,
        Людоїдами лихими,
        З новими ляхами?
        Не сховаєте! над Яром
        Залізняк витає
        І на Умань позирає,
        Гонту виглядає.
        Не ховайте, не топчіте
        Святого закона,
        Не зовіте преподобним
        Лютого Нерона.
        Не славтеся царевою
        Святою войною.
        Бо ви й самі не знаєте,
        Що царики коять.
        А кричите, що несете
        І душу і шкуру
        За отечество!.. Єй-богу,
        Овеча натура;
        Дурний шию підставляє
        І не знає за що!
        Та ще й Гонту зневажає,
        Ледаче ледащо!
        \"Гайдамаки не воины —
        Розбойники, воры.
        Пятно в наший истории...\"
        Брешеш, людоморе!
        За святую правду-волю
        Розбойник не стане,
        Не розкує закований
        У ваші кайдани
        Народ темний, не заріже
        Лукавого сина,
        Не розіб'є живе серце
        За свою країну.
        Ви — розбойники неситі,
        Голодні ворони.
        По якому правдивому,
        Святому закону
        І землею, всім даною,
        І сердешним людом
        Торгуєте? Стережіться ж,
        Бо лихо вам буде,
        Тяжке лихо!.. Дуріть Дітей
        І брата сліпого,
        Дуріть себе, чужих людей,
        Та не дуріть Бога.
        Бо в день радості над вами
        Розпадеться кара.
        І повіє огонь новий
        З Холодного Яру."""

lira = r"""Світало. Тихо диха
        Між росами тіло.
        Упале, заспале тіло душу білую гріло.
        Над тілом зійшли вишні –
        Не марило тіло –
        Росою рясною тіло душу білую вмило.
        Там – неба води,
        Як світ променистий,
        Світ прозорий, чистий –
        Плід неба вроди.
        Там сонце встало,
        Там сонце сіло –
        То все-вишні бавили тіло.
        Зітхай, востаннє зіграй,
        Лірнику снів неземних.
        Україною вишні
        Кольору злив рясних.
        Світало. Вигравало
        Над росами тіло.
        Красою ясною тіло душу вабило сміло.
        Шляхами, під небесами
        Гуляючі мрії,
        Як вії повії, як аркан у зайди на шиї.
        Там – неба води,
        Як світ променистий,
        Світ прозорий, чистий –
        Плід неба вроди.
        Там сонце зій шло,
        Там сонце сіло –
        То все-вишні бавили тіло.
        Світало. Рівно диха
        Блукаюче тіло.
        Світання вітало, як арканом бавилось уміло.
        А небо – сонця зливи –
        Потоками било,
        Красою рясною –
        То все-вишні бавили тіло."""

petya_texts = ["повне уністоження наркодиллерів", "сіські о чіловєкє нічеґо не ґоворят",
               "єбашити то всьо, і навадити порядок!", "хто такий емсі педро", "можна мені на него на водочку",
               "а ми тебе закриєм у шухляду", "з голови єбашу залізо мої руки такі сильні як скала !",
               "труси з кропиви реуомендую !", "мс петя йди нахуй хейтери ахуєнні",
               "в мене є яйця я мужик добре що я не жінка", "фотошоп братан фотошоп",
               "жінка наїласи фасуль", "морква буряк в мене на соню цілий тиждень стояк !"
                                       "криза з презервативами є кишка свині якшо ти в селі",
               "небо має ноги місяць має очі",
               "анджеліні межи ноги засадив", "соня а що таке фен ?", z_holodnogo_yaru, lira]
